#练习2-2

# 1.将两种不同类型的数据用c()组合在一起，看输出结果
# 2.生成1到30之间所有4的倍数，答案是
# 4，8，12，16，20，24，28
# 3.生成sample4，sample8，sample12…sample28
# 提示：paste0


#练习2-4

# 1.将基因名"ACTR3B","ANLN","BAG1","BCL2","BIRC5","RAB","ABCT","ANLN","BAD","BCF","BARC7","BALV"组成一个向量，赋值给x。
# 2.用函数计算向量长度
# 3.用向量取子集的方法，选出第1,3,5,7,9,11个基因名
# 4.用向量取子集的方法，除倒数第2个以外所有的基因名
# 5.用向量取子集的方法，选出在"ANLN", "BCL2","TP53"中有的基因名。
# 提示：%in%
# 6.修改第6个基因名为“a” 并查看是否成功
# 7.生成10个随机数: rnorm(n=10,mean=0,sd=18)，用向量取子集的方法，筛选出其中小于-2的值

x<-c("ACTR3B","ANLN","BAG1","BCL2","BIRC5","RAB","ABCT","ANLN","BAD","BCF","BARC7","BALV")
length(x)
x[c(1,3,5,7,9,11)]
x[-11]
y<-c("ANLN", "BCL2","TP53")

x[x%in%y]
x[6]<-"a"
x
z<-rnorm(n=10,mean=0,sd=18)## rnorm 本身生成随机数向量
z[z<(-2)]
