# 练习3-1
# 1.读取excise.csv这个文件，赋值给test。
# 2.描述test的属性(行名列名，行数列数)。
# 3.求第一列数值的中位数
# 4.修改test前两列的列名为Length和Width
# 5.提取test中，最后一列值为a或c的行，组成一个新的数据框，赋值给test2。

# 练习3-2
# 1.统计iris最后一列有哪几个取值，每个取值重复了多少次
# 2.提取iris的前10行，前4列，并转换为矩阵，赋值给a。
# 3.将a的行名改为flower1，flower2...flower10。
# 4.将a的第4到7行删除(提示：删除也是一种修改)
# 5.b = rnorm(3),将a和b组成一个列表，赋值给x
# 6.探索x[2]和x[[2]]的区别（提示：数据结构）
# 8.探索：列表x的元素有名字（names）吗？
# 如果有，它的名字是什么
# 如果没有，试着给它加上名字，随便取名即可。

# 练习4-1
# 1、选择题，不写了
# 2、写一个函数，参数是一个数值型向量，输出结果是该向量的平均值加2倍的标准差，并写出用户使用该函数的代码 。

# 练习4-2
# 安装任意2个R包，并加载
# BiocManager
# dplyr
# stringr
# VennDiagram
# factoextra
# birta
# IRanges
# Biostrings
# genefilter
# graph
# 安装后加载，library是检验是否安装成功的金标准

#练习5-1：
# 1.读取complete_set.txt（已保存在工作目录）
# 2.查看有多少行、多少列
# 3.获取行名和列名
# 4.导出为csv格式
# 5.保存为Rdata，再加载它
# 6.加载y.Rdata,求gene1列的平均值

